app/views/games/_game_status.erb


<%= (@game.word.chars.map\
{ |character| @game.guesses.map(&:guess).include?(character) ? character : "_" }).join %>
---
SELECT "guesses".* FROM "guesses" WHERE "guesses"."game_id" = ?  [["game_id", 20]]