app/views/games/index.html.erb

SELECT "guesses".* FROM "guesses" WHERE "guesses"."game_id" = ?  [["game_id", 54]]
---
      <% if game.running? %>
        <td><%= (game.word.chars.map\
          { |character| game.guesses.map(&:guess).include?(character) ?\
             character : "_" }).join %></td>