app/controllers/games_controller.rb

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]

  def create
    @game = Game.new(game_params)

    if @game.save
---
INSERT INTO "games" ("word", "created_at", "updated_at") VALUES (?, ?, ?)  [["word", "test"], ["created_at", "2016-02-16 20:24:53.440695"], ["updated_at", "2016-02-16 20:24:53.440695"]]