app/controllers/guesses_controller.rb

  def create
    @game = Game.find(params[:game_id])
    @guess = @game.guesses.build(guess_params)

    if @guess.save
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "guesses" ("guess", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["guess", "a"], ["game_id", 4], ["created_at", "2016-02-18 22:46:11.483516"], ["updated_at", "2016-02-18 22:46:11.483516"]]